RT-Thread/rt-thread/bsp/freescale/platform/hal/src/sim/MKL24Z4/fsl_sim_hal_MKL24Z4.h
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#if !defined(__FSL_SIM_HAL_KL24Z4_H__)
#define __FSL_SIM_HAL_KL24Z4_H__

/*! @addtogroup sim_hal*/
/*! @{*/

/*! @file*/

/*******************************************************************************
 * Definitions
 ******************************************************************************/

 /*! @brief COP clock source select */
typedef enum _clock_cop_src_t
{
    kClockCopSrcLpoClk,       /* LPO                                          */
    kClockCopSrcAltClk,       /* Altnative clock, for KL24Z4 it is Bus clock. */
} clock_cop_src_t;

/*! @brief TPM clock source select */
typedef enum _clock_tpm_src
{
    kClockTpmSrcNone,             /* clock disabled */
    kClockTpmSrcPllFllSel,        /* clock as selected by SOPT2[PLLFLLSEL]. */
    kClockTpmSrcOsc0erClk,        /* OSCERCLK clock */
    kClockTpmSrcMcgIrClk          /* MCGIR clock */
} clock_tpm_src_t;

/*! @brief LPTMR clock source select */
typedef enum _clock_lptmr_src_t
{
    kClockLptmrSrcMcgIrClk,        /* MCG out clock  */
    kClockLptmrSrcLpoClk,             /* LPO clock      */
    kClockLptmrSrcEr32kClk,        /* ERCLK32K clock */
    kClockLptmrSrcOsc0erClk,       /* OSCERCLK clock */
} clock_lptmr_src_t;

/*! @brief UART0 clock source select */
typedef enum _clock_lpsci_src
{
    kClockLpsciSrcNone,             /* clock disabled */
    kClockLpsciSrcPllFllSel,        /* clock as selected by SOPT2[PLLFLLSEL]. */
    kClockLpsciSrcOsc0erClk,        /* OSCERCLK clock */
    kClockLpsciSrcMcgIrClk          /* MCGIR clock */
} clock_lpsci_src_t;

/*! @brief USB clock source select */
#if FSL_FEATURE_SOC_USB_COUNT
typedef enum _clock_usbfs_src
{
    kClockUsbfsSrcExt,       /* USB CLKIN Clock */
    kClockUsbfsSrcPllFllSel    /* clock as selected by SOPT2[PLLFLLSEL] */
} clock_usbfs_src_t;
#endif

/*! @brief SIM PLLFLLSEL clock source select */
typedef enum _clock_pllfll_sel
{
    kClockPllFllSelFll,       /* Fll clock */
    kClockPllFllSelPll        /* Pll0 clock */
} clock_pllfll_sel_t;

/*! @brief SIM external reference clock source select (OSC32KSEL) */
typedef enum _clock_er32k_src
{
    kClockEr32kSrcOsc0     = 0U,     /* OSC 32k clock */
    kClockEr32kSrcReserved = 1U,     /* Reserved */
    kClockEr32kSrcRtc      = 2U,     /* RTC 32k clock */
    kClockEr32kSrcLpo      = 3U      /* LPO clock */
} clock_er32k_src_t;

/*! @brief SIM CLKOUT_SEL clock source select */
typedef enum _clock_clkout_src
{
    kClockClkoutReserved  = 0U,        /* Reserved */
    kClockClkoutReserved1 = 1U,        /* Reserved */
    kClockClkoutBusClk    = 2U,        /* Bus clock */
    kClockClkoutLpoClk    = 3U,        /* LPO clock */
    kClockClkoutMcgIrClk  = 4U,        /* MCG ir clock */
    kClockClkoutReserved2 = 5U,        /* Reserved */
    kClockClkoutOsc0erClk = 6U,        /* OSC0ER clock */
    kClockClkoutReserved3 = 7U         
} clock_clkout_src_t;

/*! @brief SIM RTCCLKOUTSEL clock source select */
typedef enum _clock_rtcout_src
{
    kClockRtcoutSrc1Hz,         /* 1Hz clock */
    kClockRtcoutSrc32kHz        /* 32KHz clock */
} clock_rtcout_src_t;

/*! @brief SIM USB voltage regulator in standby mode setting during stop modes */
#if FSL_FEATURE_SOC_USB_COUNT
typedef enum _sim_usbsstby_mode
{
    kSimUsbsstbyNoRegulator,        /* regulator not in standby during Stop modes */
    kSimUsbsstbyWithRegulator       /* regulator in standby during Stop modes */
} sim_usbsstby_mode_t;

/*! @brief SIM USB voltage regulator in standby mode setting during VLPR and VLPW modes */
typedef enum _sim_usbvstby_mode
{
    kSimUsbvstbyNoRegulator,        /* regulator not in standby during VLPR and VLPW modes */
    kSimUsbvstbyWithRegulator       /* regulator in standby during VLPR and VLPW modes */
} sim_usbvstby_mode_t;
#endif

/*! @brief SIM ADCx pre-trigger select */
typedef enum _sim_adc_pretrg_sel
{
    kSimAdcPretrgselA,              /* Pre-trigger A selected for ADCx */
    kSimAdcPretrgselB               /* Pre-trigger B selected for ADCx */
} sim_adc_pretrg_sel_t;

/*! @brief SIM ADCx trigger select */
typedef enum _sim_adc_trg_sel
{
    kSimAdcTrgselExt       = 0U,         /* External trigger */
    kSimAdcTrgSelComp0     = 1U,         /* CMP0 output */
    kSimAdcTrgSelReserved  = 2U,         /* Reserved */
    kSimAdcTrgSelReserved1 = 3U,         /* Reserved */
    kSimAdcTrgSelPit0      = 4U,         /* PIT trigger 0 */
    kSimAdcTrgSelPit1      = 5U,         /* PIT trigger 1 */
    kSimAdcTrgSelReserved2 = 6U,         /* Reserved */
    kSimAdcTrgSelReserved3 = 7U,         /* Reserved */
    kSimAdcTrgSelTpm0      = 8U,         /* TPM0 overflow */
    kSimAdcTrgSelTpm1      = 9U,         /* TPM1 overflow */
    kSimAdcTrgSelTpm2      = 10U,        /* TPM2 overflow */
    kSimAdcTrgSelReserved4 = 11U,        /* Reserved */
    kSimAdcTrgSelRtcAlarm  = 12U,        /* RTC alarm */
    kSimAdcTrgSelRtcSec    = 13U,        /* RTC seconds */
    kSimAdcTrgSelLptimer   = 14U,        /* Low-power timer trigger */
    kSimAdcTrgSelReserved5 = 15U         /* Reserved */
} sim_adc_trg_sel_t;

/*! @brief SIM UART receive data source select */
typedef enum _sim_uart_rxsrc
{
    kSimUartRxsrcPin,               /* UARTx_RX Pin */
    kSimUartRxsrcCmp0,              /* CMP0 */
} sim_uart_rxsrc_t;

/*! @brief SIM UART transmit data source select */
typedef enum _sim_uart_txsrc
{
    kSimUartTxsrcPin,               /* UARTx_TX Pin */
    kSimUartTxsrcTpm0,              /* UARTx_TX pin modulated with TPM1 channel 0 output */
    kSimUartTxsrcTpm1,              /* UARTx_TX pin modulated with TPM2 channel 0 output */
    kSimUartTxsrcReserved           /* Reserved */
} sim_uart_txsrc_t;

/*! @brief SIM LPSCI receive data source select */
typedef enum _sim_lpsci_rxsrc
{
    kSimLpsciRxsrcPin,               /* LPSCIx_RX Pin */
    kSimLpsciRxsrcCmp0,              /* CMP0 */
} sim_lpsci_rxsrc_t;

/*! @brief SIM LPSCI transmit data source select */
typedef enum _sim_lpsci_txsrc
{
    kSimLpsciTxsrcPin,               /* LPSCIx_TX Pin */
    kSimLpsciTxsrcTpm0,              /* LPSCIx_TX pin modulated with TPM1 channel 0 output */
    kSimLpsciTxsrcTpm1,              /* LPSCIx_TX pin modulated with TPM2 channel 0 output */
    kSimLpsciTxsrcReserved           /* Reserved */
} sim_lpsci_txsrc_t;

/*! @brief SIM Timer/PWM external clock select */
typedef enum _sim_tpm_clk_sel
{
    kSimTpmClkSel0,                 /* Timer/PWM TPM_CLKIN0 pin. */
    kSimTpmClkSel1                  /* Timer/PWM TPM_CLKIN1 pin. */
} sim_tpm_clk_sel_t;

/*! @brief SIM Timer/PWM x channel y input capture source select */
typedef enum _sim_tpm_ch_src
{
    kSimTpmChSrc0,                  /* TPMx_CH0 signal */
    kSimTpmChSrc1,                  /* CMP0 output */
    kSimTpmChSrc2,                  /* Reserved */
    kSimTpmChSrc3                   /* USB start of frame pulse */	
} sim_tpm_ch_src_t;

/* SCGC bit index. */
#define FSL_SIM_SCGC_BIT(SCGCx, n) (((SCGCx-1U)<<5U) + n)

typedef enum _sim_clock_gate_name
{
    kSimClockGateI2c0      = FSL_SIM_SCGC_BIT(4U, 6U),
    kSimClockGateI2c1      = FSL_SIM_SCGC_BIT(4U, 7U),
    kSimClockGateLpsci0    = FSL_SIM_SCGC_BIT(4U, 10U),
    kSimClockGateUart1     = FSL_SIM_SCGC_BIT(4U, 11U),
    kSimClockGateUart2     = FSL_SIM_SCGC_BIT(4U, 12U),
    kSimClockGateUsbfs0    = FSL_SIM_SCGC_BIT(4U, 18U),
    kSimClockGateCmp0      = FSL_SIM_SCGC_BIT(4U, 19U),
    kSimClockGateSpi0      = FSL_SIM_SCGC_BIT(4U, 22U),
    kSimClockGateSpi1      = FSL_SIM_SCGC_BIT(4U, 23U),
    kSimClockGateLptmr0    = FSL_SIM_SCGC_BIT(5U, 0U),
    kSimClockGateTsi0      = FSL_SIM_SCGC_BIT(5U, 5U),
    kSimClockGatePortA     = FSL_SIM_SCGC_BIT(5U, 9U),
    kSimClockGatePortB     = FSL_SIM_SCGC_BIT(5U, 10U),
    kSimClockGatePortC     = FSL_SIM_SCGC_BIT(5U, 11U),
    kSimClockGatePortD     = FSL_SIM_SCGC_BIT(5U, 12U),
    kSimClockGatePortE     = FSL_SIM_SCGC_BIT(5U, 13U),
    kSimClockGateFtf0      = FSL_SIM_SCGC_BIT(6U, 0U),
    kSimClockGateDmamux0   = FSL_SIM_SCGC_BIT(6U, 1U),
    kSimClockGatePit0      = FSL_SIM_SCGC_BIT(6U, 23U),
    kSimClockGateTpm0      = FSL_SIM_SCGC_BIT(6U, 24U),
    kSimClockGateTpm1      = FSL_SIM_SCGC_BIT(6U, 25U),
    kSimClockGateTpm2      = FSL_SIM_SCGC_BIT(6U, 26U),
    kSimClockGateAdc0      = FSL_SIM_SCGC_BIT(6U, 27U),
    kSimClockGateRtc0      = FSL_SIM_SCGC_BIT(6U, 29U),
    kSimClockGateDac0      = FSL_SIM_SCGC_BIT(6U, 31U),
    kSimClockGateDma0      = FSL_SIM_SCGC_BIT(7U, 8U)
} sim_clock_gate_name_t;

